-----------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\wrmaechl\OneDrive - Syracuse University\Documents\GitHub\course-project-zipcentercrime\Reproducibility 
> Package\Do Files\Full_Data_log.log
  log type:  text
 opened on:  17 Dec 2024, 16:27:16

. 
. *** This should be the file you exported from ArcGIS
. 
. import delimited "ExtraFiles\2017_Arc_Data.csv"
(encoding automatically selected: UTF-8)
(2 vars, 620,359 obs)

. 
. *** This drops any values that were further than 2500 meters from any treatment center
. 
. drop if near_dist == -1
(205,143 observations deleted)

. 
. *** this is install programs that are usefull in exporting tables
. 
. ssc install outreg2
checking outreg2 consistency and verifying not already installed...
all files already exist and are up to date.

. ssc install estout
checking estout consistency and verifying not already installed...
all files already exist and are up to date.

. 
. *** these commands seperate the data points from ArcGIS into groups based on their calculated distance to the nearest treat
> ment center in meters
. 
. gen dist_group = 100 if near_dist <= 100 
(411,292 missing values generated)

. replace dist_group = 250 if (near_dist <= 250 & near_dist >100)
(13,571 real changes made)

. replace dist_group = 500 if (near_dist <= 500 & near_dist >250)
(43,553 real changes made)

. replace dist_group = 750 if (near_dist <= 750 & near_dist >500)
(46,198 real changes made)

. replace dist_group = 1000 if (near_dist <= 1000 & near_dist >750)
(59,258 real changes made)

. replace dist_group = 1250 if (near_dist <= 1250 & near_dist >1000)
(64,059 real changes made)

. replace dist_group = 1500 if (near_dist <= 1500 & near_dist >1250)
(53,583 real changes made)

. replace dist_group = 1750 if (near_dist <= 1750 & near_dist >1500)
(46,384 real changes made)

. replace dist_group = 2000 if (near_dist <= 2000 & near_dist >1750)
(32,171 real changes made)

. replace dist_group = 2250 if (near_dist <= 2250 & near_dist >2000)
(30,260 real changes made)

. replace dist_group = 2500 if (near_dist <= 2500 & near_dist >2250)
(22,255 real changes made)

. 
. *** these commands are used to make a second variable that is one distance size smaller than its actrual group which allows
>  us to calculate the difference in area between the two radii
. 
. gen dist_group2 = 0 if near_dist <= 100 
(411,292 missing values generated)

. replace dist_group2 = 100 if (near_dist <= 250 & near_dist >100)
(13,571 real changes made)

. replace dist_group2 = 250 if (near_dist <= 500 & near_dist >250)
(43,553 real changes made)

. replace dist_group2 = 500 if (near_dist <= 750 & near_dist >500)
(46,198 real changes made)

. replace dist_group2 = 750 if (near_dist <= 1000 & near_dist >750)
(59,258 real changes made)

. replace dist_group2 = 1000 if (near_dist <= 1250 & near_dist >1000)
(64,059 real changes made)

. replace dist_group2 = 1250 if (near_dist <= 1500 & near_dist >1250)
(53,583 real changes made)

. replace dist_group2 = 1500 if (near_dist <= 1750 & near_dist >1500)
(46,384 real changes made)

. replace dist_group2 = 1750 if (near_dist <= 2000 & near_dist >1750)
(32,171 real changes made)

. replace dist_group2 = 2000 if (near_dist <= 2250 & near_dist >2000)
(30,260 real changes made)

. replace dist_group2 = 2250 if (near_dist <= 2500 & near_dist >2250)
(22,255 real changes made)

. replace dist_group2 = 2500 if (near_dist <= 2750 & near_dist >2500)
(0 real changes made)

. 
. *** this uses the two distance groups calculated above as radii to find the area of that circle and subtract the area of th
> e smaller adjecent circle to calculate the total area of the ring that those calls came from to standardize the data as Cal
> ls per Area
. 
. egen freq = count(near_dist), by(dist_group)

. gen area = (c(pi) * dist_group^2) - (c(pi) * dist_group2^2) 

. 
. *** This is used to get the exact amount of area so that we can divide our count of calls for each distance group once we c
> ollapse the data on line 71
. 
. tab area 

       area |      Freq.     Percent        Cum.
------------+-----------------------------------
   31415.93 |      3,924        0.95        0.95
   164933.6 |     13,571        3.27        4.21
   589048.6 |     43,553       10.49       14.70
   981747.7 |     46,198       11.13       25.83
    1374447 |     59,258       14.27       40.10
    1767146 |     64,059       15.43       55.53
    2159845 |     53,583       12.90       68.43
    2552544 |     46,384       11.17       79.60
    2945243 |     32,171        7.75       87.35
    3337942 |     30,260        7.29       94.64
    3730641 |     22,255        5.36      100.00
------------+-----------------------------------
      Total |    415,216      100.00

. 
. *** taking that difference in area and dividing the amount of calls in that specific distance group by the new ring of area
>  will give us the number of calls per the increase in area from one ring to the next largest
. 
. gen CallxArea = freq / area

. 
. *** these commands create new seperate variables for each distance group 
. 
. gen dist_group_100 = 1 if near_dist <= 100
(411,292 missing values generated)

. gen dist_group_250 = 1 if (near_dist <= 250 & near_dist >100)
(401,645 missing values generated)

. gen dist_group_500 = 1 if (near_dist <= 500 & near_dist >250)
(371,663 missing values generated)

. gen dist_group_750 = 1 if (near_dist <= 750 & near_dist >500)
(369,018 missing values generated)

. gen dist_group_1000 = 1 if (near_dist <= 1000 & near_dist >750)
(355,958 missing values generated)

. gen dist_group_1250 = 1 if (near_dist <= 1250 & near_dist >1000)
(351,157 missing values generated)

. gen dist_group_1500 = 1 if (near_dist <= 1500 & near_dist >1250)
(361,633 missing values generated)

. gen dist_group_1750 = 1 if (near_dist <= 1750 & near_dist >1500)
(368,832 missing values generated)

. gen dist_group_2000 = 1 if (near_dist <= 2000 & near_dist >1750)
(383,045 missing values generated)

. gen dist_group_2250 = 1 if (near_dist <= 2250 & near_dist >2000)
(384,956 missing values generated)

. gen dist_group_2500 = 1 if (near_dist <= 2500 & near_dist >2250)
(392,961 missing values generated)

. 
. 
. 
. 
. *** This command colapses our data down, Using the various variables we created for each seperate distance groups we can no
> w collapse the data by the count of how many of our observations are within each individual distance groups by the id numbe
> r for the treatment center it was nearest.
. 
. collapse (count) dist_group_100 dist_group_250 dist_group_500 dist_group_750 dist_group_1000 dist_group_1250 dist_group_150
> 0 dist_group_1750 dist_group_2000 dist_group_2250 dist_group_2500, by(near_fid)

. 
. *** once our data is collapsed we use these commands to standardize the number of calls by the areas of the rings we calcul
> ated previously 
. 
. replace dist_group_100 = (dist_group_100 / 31415.9265) * 1000000
variable dist_group_100 was long now double
(36 real changes made)

. replace dist_group_250 = (dist_group_250 / 164933.6143) * 1000000
variable dist_group_250 was long now double
(43 real changes made)

. replace dist_group_500 = (dist_group_500 / 589048.6225) * 1000000
variable dist_group_500 was long now double
(43 real changes made)

. replace dist_group_750 = (dist_group_750 / 981747.7042) * 1000000
variable dist_group_750 was long now double
(43 real changes made)

. replace dist_group_1000 = (dist_group_1000 / 1374446.786) * 1000000
variable dist_group_1000 was long now double
(43 real changes made)

. replace dist_group_1250 = (dist_group_1250 / 1767145.868) * 1000000
variable dist_group_1250 was long now double
(43 real changes made)

. replace dist_group_1500 = (dist_group_1500 / 2159844.949) * 1000000
variable dist_group_1500 was long now double
(42 real changes made)

. replace dist_group_1750 = (dist_group_1750 / 2552544.031) * 1000000
variable dist_group_1750 was long now double
(39 real changes made)

. replace dist_group_2000 = (dist_group_2000 / 2945243.113) * 1000000
variable dist_group_2000 was long now double
(36 real changes made)

. replace dist_group_2250 = (dist_group_2250 / 3337942.194) * 1000000
variable dist_group_2250 was long now double
(30 real changes made)

. replace dist_group_2500 = (dist_group_2500 / 3730641.276) * 1000000
variable dist_group_2500 was long now double
(28 real changes made)

. 
. *** This will create a group called vars for this loop to run through
. 
. local vars dist_group_100 dist_group_250 dist_group_500 dist_group_750 dist_group_1000 dist_group_1250 dist_group_1500 dist
> _group_1750 dist_group_2000 dist_group_2250 dist_group_2500

. 
. *** Create a blank matrix for the data to go in
. 
. matrix summary_results = J(1, 6, .)

. 
. *** Start the loop
. 
. foreach var of local vars {
  2.    
.    *** This is to summarize each variable 
.     summarize `var', detail
  3.     
.     *** This will save each of the needed summary stats from the Data
. 
.     local N = r(N)
  4.     local mean = r(mean)
  5.     local sd = r(sd)
  6.     local sum = r(sum)
  7.     local min = r(min)
  8.     local max = r(max)
  9.     
.         *** This adds the captured data into the Matrix
.     
.     matrix summary_results = summary_results \ (`N', `mean', `sd', `sum', `min', `max')
 10.         }

                   (count) dist_group_100
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                  44
25%     588.8733              0       Sum of wgt.          44

50%     1798.451                      Mean           2838.745
                        Largest       Std. dev.      3046.525
75%     4010.705       8785.353
90%     8085.071       8817.184       Variance        9281316
95%     8817.184        10376.9       Skewness       1.356683
99%     11968.45       11968.45       Kurtosis       4.096271

                   (count) dist_group_250
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%     12.12609       12.12609
10%     30.31523       12.12609       Obs                  44
25%     724.5339       18.18914       Sum of wgt.          44

50%     1418.753                      Mean           1870.036
                        Largest       Std. dev.      1906.982
75%     2137.224       4820.121
90%     4729.175       6123.676       Variance        3636579
95%     6123.676       6378.324       Skewness       1.705146
99%     8694.407       8694.407       Kurtosis       5.807883

                   (count) dist_group_500
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%     8.488264       6.790611
10%     95.06855       8.488264       Obs                  44
25%     629.8292       39.04601       Sum of wgt.          44

50%      1185.81                      Mean           1680.406
                        Largest       Std. dev.      1721.943
75%     1869.116       5092.958
90%      3695.79       6211.711       Variance        2965088
95%     6211.711       6590.288       Skewness       1.773508
99%     7086.002       7086.002       Kurtosis       5.629117

                   (count) dist_group_750
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%     17.31606       13.24169
10%     201.6811       17.31606       Obs                  44
25%     541.8908       132.4169       Sum of wgt.          44

50%     1024.194                      Mean           1069.475
                        Largest       Std. dev.      711.9805
75%      1526.36       2237.846
90%      2141.08       2258.218       Variance       506916.2
95%     2258.218       2635.097       Skewness       .5000187
99%     2694.175       2694.175       Kurtosis       2.470598

                   (count) dist_group_1000
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%      100.404       77.12194
10%     280.8403        100.404       Obs                  44
25%     444.5425       195.7151       Sum of wgt.          44

50%     782.4966                      Mean           979.8653
                        Largest       Std. dev.      686.1379
75%     1463.134       1898.946
90%      1837.83       2442.437       Variance       470785.3
95%     2442.437       2639.607       Skewness        .831115
99%      2722.55        2722.55       Kurtosis       2.998284

                   (count) dist_group_1250
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%     44.13897       .5658842
10%     69.60376       44.13897       Obs                  44
25%     332.7399       63.94492       Sum of wgt.          44

50%     669.1581                      Mean           823.8632
                        Largest       Std. dev.      680.5173
75%     1143.935        1907.03
90%     1523.926       2227.886       Variance       463103.8
95%     2227.886       2467.255       Skewness       1.330445
99%     3141.789       3141.789       Kurtosis       5.000484

                   (count) dist_group_1500
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%     .4629962              0
10%     14.35288       .4629962       Obs                  44
25%     148.1588       10.18592       Sum of wgt.          44

50%     381.7404                      Mean           563.8347
                        Largest       Std. dev.      565.9372
75%     872.5163       1520.017
90%     1244.071       1888.098       Variance       320284.9
95%     1888.098       2032.553       Skewness       1.371865
99%     2321.463       2321.463       Kurtosis        4.51875

                   (count) dist_group_1750
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                  44
25%     52.69253              0       Sum of wgt.          44

50%     296.5669                      Mean           412.9926
                        Largest       Std. dev.      432.5729
75%     618.7944       1180.391
90%     917.9078       1390.769       Variance       187119.3
95%     1390.769       1611.334       Skewness        1.26669
99%     1617.602       1617.602       Kurtosis       4.062333

                   (count) dist_group_2000
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                  44
25%     1.358122              0       Sum of wgt.          44

50%     166.0304                      Mean           248.2508
                        Largest       Std. dev.      279.9933
75%     378.7463       798.2363
90%      760.888        823.022       Variance       78396.23
95%      823.022       911.6395       Skewness       1.077564
99%      956.118        956.118       Kurtosis       3.132897

                   (count) dist_group_2250
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                  44
25%            0              0       Sum of wgt.          44

50%     109.7982                      Mean           206.0333
                        Largest       Std. dev.      270.5081
75%     252.1014       731.5885
90%     726.1959       796.5986       Variance       73174.63
95%     796.5986       819.3671       Skewness       1.491236
99%      1019.79        1019.79       Kurtosis       4.142539

                   (count) dist_group_2500
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                  44
25%            0              0       Sum of wgt.          44

50%     54.95034                      Mean           135.5787
                        Largest       Std. dev.      178.7922
75%     208.5432        499.378
90%     397.7868       550.3075       Variance       31966.64
95%     550.3075       591.5873       Skewness       1.427627
99%     655.3833       655.3833       Kurtosis       4.181603

. 
.         *** Change column and row names
. matrix colnames summary_results = "Obs" "Mean" "Std. dev." "Sum" "Min" "Max"

. 
. *** Delete empty row from matrix
. 
. matrix summary_results = summary_results[2..12, 1..colsof(summary_results)]

. 
. *** Rename the rows
. matrix rownames summary_results = "100m" "250m" "500m" "750m" "1000m" "1250m" "1500m" "1750m" "2000m" "2250m" "2500m"

. 
. matrix list summary_results

summary_results[11,6]
             Obs       Mean  Std. dev.        Sum        Min        Max
 100m         44  2838.7454  3046.5252   124904.8          0  11968.452
 250m         44  1870.0361  1906.9816   82281.59          0  8694.4072
 500m         44  1680.4061  1721.9431  73937.869          0  7086.0025
 750m         44  1069.4749  711.98049  47056.896          0  2694.1749
1000m         44  979.86531  686.13794  43114.074          0  2722.5499
1250m         44  823.86315  680.51729  36249.979          0  3141.7893
1500m         44  563.83467  565.93718  24808.725          0  2321.4629
1750m         44  412.99261  432.57287  18171.675          0  1617.6019
2000m         44  248.25084  279.99327  10923.037          0  956.11802
2250m         44  206.03331  270.50809  9065.4656          0    1019.79
2500m         44  135.57869  178.79218  5965.4623          0   655.3833

. 
. *** Export table
. 
. esttab matrix(Call_Summary_Stats) using "Visual Graphics\Call_Summary_Stats.tex", title("Call Summary Stats")replace
matrix Call_Summary_Stats not found
r(111);

end of do-file

r(111);

. esttab matrix(summary_results) using "Visual Graphics\Call_Summary_Stats.tex", title("Call Summary Stats")replace
(output written to Visual Graphics\Call_Summary_Stats.tex)

. clear

. log close
      name:  <unnamed>
       log:  C:\Users\wrmaechl\OneDrive - Syracuse University\Documents\GitHub\course-project-zipcentercrime\Reproducibility 
> Package\Do Files\Full_Data_log.log
  log type:  text
 closed on:  17 Dec 2024, 16:27:48
-----------------------------------------------------------------------------------------------------------------------------
